// Домашня робота:
// 1 Знаходження всіх великих літер в тексті і збереження їх в масив

// let textStr = "    Lorem ipsum dolor sit amet consectetur adipisicing elit. Eos itaque vero laborum fugit harum! Quia, cumque necessitatibus nemo veniam odit dolor impedit aspernatur, ipsa vitae minima quasi doloribus repellendus cupiditate!";

// 2 Вибір числових значень з строки
// let operation = "5 плюс 7 = 3";

// 3  Знаходження слів із певною кількістю символів:
// Напишіть регулярний вираз для знаходження слів у тексті, що складаються рівно з 5 букв, можна взяти текст з textStr з першого завдання

// 4 Створіть веб-сторінку з текстовим полем і кнопкою. При натисканні на кнопку, збережіть введення користувача у sessionStorage. Додайте ще одну кнопку, яка при натисканні відображатиме збережені дані у веб-сторінці.

// 5 Створіть форму з полями email та password  та кнопкою відправити. Та напишіть функції які перевіряють дані на валідність.  Пароль мінімум 8 символів і повинен містити цифрові значення та літери в верхньому регістрі.
// Якщо дані невалідні не заповненні відповідно то кнопка відправити має стан disabled
// Додаткова робота:
// - Модифікуйте список задач щоб він  зберігав додані пункти в localstorage і при оновлені сторінки виводив список задач які були додані до цього. Також реалізуйте механізм видалення данних. Щоб дані в локалсторедж синхронізувались  з станом списку задач.