// Створіть змінні number1 та number2 і використайте оператори порівняння, щоб визначити, чи вони рівні.
// Виведіть результат за допомогою alert, щоб повідомити користувача про те, чи рівні числа.
let number1 = 123;
let number2 = 45;
alert(`123 = 45? ${number1==number2}`);
alert(`123 > 45? ${number1>number2}`);
alert(`123 < 45? ${number1<number2}`);
alert(`123 = '123'? ${number1=='123'}`);
alert(`45 = -45? ${number2==-45}`);
alert(`123 ≠ 45? ${number1!=number2}`);

//1) Напишіть програму, яка приймає довжину та ширину прямокутника як вхідні дані. Обчисліть площу прямокутника і виведіть результат у консоль. Формула для обчислення площі прямокутника: 𝑆=довжина*ширина
//2) Напишіть програму, яка приймає довжину та ширину прямокутника як вхідні дані. Обчисліть периметр прямокутника і виведіть результат у консоль. Формула для обчислення периметру прямокутника: 𝑃=2*(довжина+ширина)
let length = Number(prompt('Введіть довжину прямокутника: '));
let width = Number(prompt('Введіть ширину прямокутника: '));
let S = length * width; //1 variant
console.log(`Площа даного прямокутника складає ${S}`);  //1 variant
console.log(`Площа даного прямокутника складає ${length * width}`); //2 variant
console.log(`Періметр даного прямокутника складає ${2*(length + width)}`);

// Додаткова робота:
// Завдання: Напишіть функцію, що конвертує температуру з градусів Цельсія в Фаренгейти. Формула: F=C×9/5+32
let celsiusDegree = Number(prompt(`Введіть температуру у °C: `));
let fahrenheitDegree = (celsiusDegree*9)/5 + 32;
console.log(`Температура ${celsiusDegree}°C складає ${fahrenheitDegree}°F`);

// Завдання: Напишіть програму, яка обчислює об'єм циліндра за формулою V=π×r2×hV = \pi \times r^2 \times h V=π×r2×h, де r — радіус, а h — висота. Виведіть результат у консоль.
let r = Number(prompt(`Введіть радіус циліндра: `));
let h = Number(prompt(`Введіть висоту циліндра: `));
const PI = 3.14;
let V = PI *(r**2)*h;
console.log(`Об'єм даного циліндра складає ${V}`);